### 1. 데이터프레임이란

In [1]:
import pandas as pd

In [3]:
data = {'name' : ['Mark', 'Jane', 'Chris','Ryan'], 'age' :[33,32,44,42], 'score' :[91.3,83.4,77.5,87.7]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

    name  age  score
0   Mark   33   91.3
1   Jane   32   83.4
2  Chris   44   77.5
3   Ryan   42   87.7

In [6]:
df.sum()

name     MarkJaneChrisRyan
age                    151
score                339.9
dtype: object

In [7]:
df.mean()

age      37.750
score    84.975
dtype: float64

In [8]:
df.age  # df['age']와 동일함

0    33
1    32
2    44
3    42
Name: age, dtype: int64

### CSV 파일 불러와 데이터프레임으로 만들기
- 05장 실습파일 폴더에서 apt.csv 찾기

In [10]:
import pandas as pd

In [27]:
import re,os

In [34]:
os.chdir(r'C:\Users\AI06\Desktop\Python\Pandas\do-it-python\05')

In [37]:
df = pd.read_csv('apt.csv', encoding ='cp949')

In [38]:
len(df)

42758

#### 1. 자료의 일부만 출력하기

In [40]:
df.head()   # 상위 5개의 데이터

,지역,번지,본번,부번,아파트,면적,계약년월,계약일,가격,층,건축년도,도로명
0,강원도 강릉시 견소동,202,202,0,송정한신,59.800,201910,4,10900,5,1997,경강로2539번길 8
1,강원도 강릉시 견소동,202,202,0,송정한신,116.175,201910,31,18500,10,1997,경강로2539번길 8
2,강원도 강릉시 견소동,289,289,0,송정해변신도브래뉴아파트,84.990,201910,5,25000,6,2005,경강로2539번길 22
3,강원도 강릉시 견소동,289,289,0,송정해변신도브래뉴아파트,84.990,201910,12,20600,3,2005,경강로2539번길 22
4,강원도 강릉시 견소동,289,289,0,송정해변신도브래뉴아파트,84.990,201910,20,20500,1,2005,경강로2539번길 22

In [41]:
df.tail()  # 하위 5개의 데이터

,지역,번지,본번,부번,아파트,면적,계약년월,계약일,가격,층,건축년도,도로명
42753,충청북도 충주시 호암동,547-6,547,6,호반현대,59.76,201910,29,7000,3,1994,신촌2길 28
42754,충청북도 충주시 호암동,221-23,221,23,호암리버빌(1단지),84.68,201910,5,12000,15,2002,원호암5길 32
42755,충청북도 충주시 호암동,221-23,221,23,호암리버빌(1단지),84.68,201910,15,11000,7,2002,원호암5길 32
42756,충청북도 충주시 호암동,221-23,221,23,호암리버빌(1단지),84.68,201910,17,12000,14,2002,원호암5길 32
42757,충청북도 충주시 호암동,221-23,221,23,호암리버빌(1단지),84.68,201910,26,11200,11,2002,원호암5길 32

#### 2. 열의 전체 자료 출력하기

In [42]:
df.지역

0         강원도 강릉시 견소동
1         강원도 강릉시 견소동
2         강원도 강릉시 견소동
3         강원도 강릉시 견소동
4         강원도 강릉시 견소동
             ...
42753    충청북도 충주시 호암동
42754    충청북도 충주시 호암동
42755    충청북도 충주시 호암동
42756    충청북도 충주시 호암동
42757    충청북도 충주시 호암동
Name: 지역, Length: 42758, dtype: object

In [44]:
df.면적>130  # True, False로 나눠서 보여줌

0        False
1        False
2        False
3        False
4        False
         ...
42753    False
42754    False
42755    False
42756    False
42757    False
Name: 면적, Length: 42758, dtype: bool

#### 3. 조건별로 출력하기

In [45]:
df[df.면적>130]  # 실제로 130이 넘는 값(True)만 출력

,지역,번지,본번,부번,아파트,면적,계약년월,계약일,가격,층,건축년도,도로명
6,강원도 강릉시 교동,1982,1982,0,강릉교동롯데캐슬1단지,135.1727,201910,21,34300,9,2009,화부산로99번길 12
39,강원도 강릉시 남문동,183-2,183,2,삼익그린맨션,164.7540,201910,15,21000,12,1992,홍제로 7-17
334,강원도 속초시 금호동,629,629,0,보람레이크더하임,156.7600,201910,16,29500,1,2008,영랑호반길 115-13
433,강원도 원주시 개운동,01월 28일,28,1,원주힐스테이트,133.9912,201910,5,26000,16,2006,행구로 54
434,강원도 원주시 개운동,01월 28일,28,1,원주힐스테이트,137.4292,201910,31,24000,14,2006,행구로 54
...,...,...,...,...,...,...,...,...,...,...,...,...
42595,충청북도 충주시 문화동,2260,2260,0,럭키,156.7900,201910,21,15000,3,1993,중원대로 3379
42607,충청북도 충주시 안림동,1166,1166,0,엘리시아,136.1287,201910,19,18500,12,2007,국원초1길 48
42663,충청북도 충주시 연수동,1627,1627,0,연수힐스테이트,143.2109,201910,14,31500,13,2007,연수동산로 26
42736,충청북도 충주시 칠금동,626,626,0,삼일,143.5800,201910,20,18500,12,1996,금릉로 17
42737,충청북도 충주시 칠금동,626,626,0,삼일,143.5800,201910,21,16200,3,1996,금릉로 17

In [46]:
df.가격[df.면적>130]

6        34300
39       21000
334      29500
433      26000
434      24000
         ...
42595    15000
42607    18500
42663    31500
42736    18500
42737    16200
Name: 가격, Length: 1567, dtype: int64

In [47]:
df.가격[(df.면적>130) & (df.가격<15000)]  # and 연산

862      14900
927      13800
16785    14700
36733    14700
37726    13700
38811    14600
39487    12000
40680    12500
41173    14000
41578    13000
Name: 가격, dtype: int64

In [48]:
df.가격[(df.면적>130) | (df.가격<15000)]  # or 연산

0        10900
6        34300
35        4600
36       13200
37       14700
         ...
42753     7000
42754    12000
42755    11000
42756    12000
42757    11200
Name: 가격, Length: 11499, dtype: int64

#### 4. 원하는 자료만 살펴보기

In [50]:
df.loc[:10, ['아파트', '가격']]  # 아파트와 가격 자료를 10번까지만 출력

                아파트     가격
0              송정한신  10900
1              송정한신  18500
2      송정해변신도브래뉴아파트  25000
3      송정해변신도브래뉴아파트  20600
4      송정해변신도브래뉴아파트  20500
5   강릉 교동 풍림아이원 아파트  29200
6       강릉교동롯데캐슬1단지  34300
7       강릉교동롯데캐슬2단지  32500
8             교동1주공  16200
9             교동1주공  21550
10            교동1주공  21800

In [51]:
df.loc[:, ['아파트', '가격']][df.가격>40000]  # 조건을 만족하는 내용만 출력

                  아파트     가격
382          속초청호아이파크  45800
541          무실e-편한세상  44600
592          원주반곡아이파크  40700
842    온의 롯데캐슬 스카이클래스  44000
843    온의 롯데캐슬 스카이클래스  42900
...               ...    ...
42364       신영지웰시티 1차  47700
42365       신영지웰시티 1차  46000
42366       신영지웰시티 1차  55800
42367       신영지웰시티 1차  67000
42424          봉명아이파크  49000

[10486 rows x 2 columns]

#### 5. 새로운 값 출력하기

In [52]:
df['단가'] = df.가격/df.면적

In [53]:
df.단가

0        182.274247
1        159.242522
2        294.152253
3        242.381457
4        241.204848
            ...
42753    117.135207
42754    141.709967
42755    129.900803
42756    141.709967
42757    132.262636
Name: 단가, Length: 42758, dtype: float64

In [54]:
df.loc[:10, ('가격', '면적', '단가')]

       가격        면적          단가
0   10900   59.8000  182.274247
1   18500  116.1750  159.242522
2   25000   84.9900  294.152253
3   20600   84.9900  242.381457
4   20500   84.9900  241.204848
5   29200   84.9964  343.543962
6   34300  135.1727  253.749463
7   32500  118.0686  275.263703
8   16200   59.8900  270.495909
9   21550   84.8400  254.007544
10  21800   84.8400  256.954267

#### 6. 데이터 정렬하기

In [58]:
df.sort_values(by ='가격').loc[:, ('가격', '지역')]  # 가격을 기준으로 오름차순 정렬
df.sort_values(by ='가격', ascending=False).loc[:, ('가격', '지역')]  # 가격을 기준으로 내림차순 정렬

           가격                지역
31258  485000     서울특별시 용산구 한남동
27061  461000     서울특별시 강남구 도곡동
29946  415000     서울특별시 서초구 반포동
26805  376640     부산광역시 해운대구 우동
27036  373000     서울특별시 강남구 대치동
...       ...               ...
17027     800      경상북도 구미시 원평동
17025     800      경상북도 구미시 원평동
17637     750  경상북도 칠곡군 약목면 관호리
17022     700      경상북도 구미시 원평동
17024     600      경상북도 구미시 원평동

[42758 rows x 2 columns]

In [60]:
df[df.가격>4000].sort_values(by='면적').loc[:,('가격','면적','계약일')]

           가격       면적  계약일
31201   17300   10.020   29
21534   11000   11.880    1
31301   11000   12.070   31
27832   13200   12.330   18
33870    5200   12.373   28
...       ...      ...  ...
27118  245000  242.820    8
30002  206000  244.420   25
10106  100000  244.663    6
31501  240000  273.820   18
35826  300000  291.336   12

[42137 rows x 3 columns]

#### 7. 문자열 다루기
- str.find() 사용하여 특정 문자를 포함하는 열 추출
- 찾는 문자열이 없다면 -1을 반환

In [61]:
df.지역.str.find('강릉')

0        4
1        4
2        4
3        4
4        4
        ..
42753   -1
42754   -1
42755   -1
42756   -1
42757   -1
Name: 지역, Length: 42758, dtype: int64

In [63]:
dfF = df[df.지역.str.find('강릉')>-1]  # 강릉에 해당하는 내용만 출력
dfF.mean()

본번               inf
부번      1.085106e+00
면적      7.047780e+01
계약년월    2.019100e+05
계약일     1.527128e+01
가격      1.541457e+04
층       7.420213e+00
건축년도    2.000463e+03
단가      2.099422e+02
dtype: float64

- 쉼표가 있는 문자를 숫자로 한 번에 바꾸기(전처리과정)

In [65]:
# 쉼표가 제거되지 않은 실습파일 apt_comma.csv 이용

In [66]:
df = pd.read_csv('apt_comma.csv', encoding='cp949')

In [69]:
df.info()   # object는 str 타입의 변수를 뜻함

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73152 entries, 0 to 73151
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   시군구     73152 non-null  object
 1   단지명     73152 non-null  object
 2   면적      73152 non-null  float64
 3   계약년월    73152 non-null  int64
 4   계약일     73152 non-null  int64
 5   가격      73152 non-null  object
 6   층       73152 non-null  int64
 7   건축년도    73152 non-null  int64
 8   도로명     73152 non-null  object
dtypes: float64(1), int64(4), object(4)
memory usage: 5.0+ MB

In [71]:
df.가격 = df.가격.str.replace(',', '').astype('int64')

In [72]:
df.가격>14000

0         True
1        False
2        False
3         True
4        False
         ...
73147     True
73148     True
73149     True
73150    False
73151    False
Name: 가격, Length: 73152, dtype: bool